Revit 2026 API

# FormatOptionsCanSuppressSpaces Method

---

Checks whether spaces can be suppressed for the display unit in this FormatOptions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanSuppressSpaces()
```
```vb
Public Function CanSuppressSpaces As Boolean
```
```cpp
public:
bool CanSuppressSpaces()
```
```fsharp
member CanSuppressSpaces : unit -> bool
```

#### Return Value

Boolean True if spaces can be suppressed, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | UseDefault is true in this FormatOptions. |

#### Reference

FormatOptions Class

CanSuppressSpaces Overload

Autodesk.Revit.DB Namespace